In [2]:
%load_ext sql
%sql postgresql://emilianodesu:password123@localhost:5432/practica5

1) Crear las tablas a usar para la práctica (Script DDL.sql)

In [13]:
%%sql
CREATE TABLE asesor(
    id_Asesor VARCHAR(4) NOT NULL,
    nombre VARCHAR(100) NOT NULL,
    CONSTRAINT asesor_pk PRIMARY KEY (id_Asesor)
);

 * postgresql://emilianodesu:***@localhost:5432/practica5
Done.

[]

In [16]:
%%sql
CREATE TABLE alumno(
    id_Alumno INT NOT NULL,
    nombre VARCHAR(100) NOT NULL,
    id_Asesor varchar(4) NULL,
    CONSTRAINT alumno_pk PRIMARY KEY (id_Alumno),
    CONSTRAINT asesor_fk FOREIGN KEY (id_Asesor) REFERENCES asesor(id_Asesor) ON DELETE SET NULL ON UPDATE CASCADE
);

 * postgresql://emilianodesu:***@localhost:5432/practica5
Done.

[]

2) Separar el atributo nombre de las tablas alumno y asesor en nombre y apellido paterno (use alters)

In [17]:
%%sql
ALTER TABLE alumno ADD COLUMN ap_pa VARCHAR(100) NULL;
ALTER TABLE asesor ADD COLUMN ap_pa VARCHAR(100) NULL;

 * postgresql://emilianodesu:***@localhost:5432/practica5
Done.
Done.

[]

3) Revisar el script inserts.sql y haga los ajustes necesarios para poder insertar los datos correctamente donde corresponda

In [18]:
%%sql
INSERT INTO asesor(id_Asesor, nombre, ap_pa) VALUES('as-1', 'Jorge', 'Campos');
INSERT INTO asesor(id_Asesor, nombre, ap_pa) VALUES('as-2', 'Laura', 'Sandoval');
INSERT INTO asesor(id_Asesor, nombre, ap_pa) VALUES('as-3', 'Adolfo', 'Millan');
INSERT INTO asesor(id_Asesor, nombre, ap_pa) VALUES('as-4', 'Fernando', 'Arreola');

INSERT INTO alumno(id_Alumno, nombre, ap_pa, id_Asesor) VALUES(1, 'Mauricio', 'Barrientos','as-1'),
(2, 'Mario', 'Tabura', 'as-2'),
(3, 'Luz', 'Rueda', 'as-1'),
(4, 'Jorge', 'Santillan', NULL),
(5, 'Laura', 'Gaytan', 'as-3');

 * postgresql://emilianodesu:***@localhost:5432/practica5
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[]

4) Ejecutar el script inserts.sql y valide que los datos sean correctos

In [19]:
%%sql
SELECT * FROM asesor;

 * postgresql://emilianodesu:***@localhost:5432/practica5
4 rows affected.

[('as-1', 'Jorge', 'Campos'),
 ('as-2', 'Laura', 'Sandoval'),
 ('as-3', 'Adolfo', 'Millan'),
 ('as-4', 'Fernando', 'Arreola')]

In [21]:
%%sql
SELECT * FROM alumno;

 * postgresql://emilianodesu:***@localhost:5432/practica5
5 rows affected.

[(1, 'Mauricio', 'as-1', 'Barrientos'),
 (2, 'Mario', 'as-2', 'Tabura'),
 (3, 'Luz', 'as-1', 'Rueda'),
 (4, 'Jorge', None, 'Santillan'),
 (5, 'Laura', 'as-3', 'Gaytan')]

# Consultas

5) Alumno U Asesor (sólo en el atributo nombre)

In [23]:
%%sql
SELECT alumno.nombre FROM alumno 
UNION
SELECT asesor.nombre FROM asesor;

 * postgresql://emilianodesu:***@localhost:5432/practica5
7 rows affected.

[('Jorge',),
 ('Mario',),
 ('Adolfo',),
 ('Laura',),
 ('Fernando',),
 ('Luz',),
 ('Mauricio',)]

6) Alumno INTERSECT Asesor (sólo en el atributo nombre)

In [28]:
%%sql
SELECT alumno.nombre FROM alumno 
INTERSECT
SELECT asesor.nombre FROM asesor;

 * postgresql://emilianodesu:***@localhost:5432/practica5
2 rows affected.

[('Jorge',), ('Laura',)]

7) Alumno - Asesor y Asesor - Alumno

In [29]:
%%sql
SELECT alumno.nombre, alumno.ap_pa FROM alumno
EXCEPT
SELECT asesor.nombre, asesor.ap_pa FROM asesor;

 * postgresql://emilianodesu:***@localhost:5432/practica5
5 rows affected.

[('Luz', 'Rueda'),
 ('Jorge', 'Santillan'),
 ('Mauricio', 'Barrientos'),
 ('Mario', 'Tabura'),
 ('Laura', 'Gaytan')]

In [31]:
%%sql
SELECT asesor.nombre, asesor.ap_pa FROM asesor
EXCEPT
SELECT alumno.nombre, alumno.ap_pa FROM alumno;

 * postgresql://emilianodesu:***@localhost:5432/practica5
4 rows affected.

[('Jorge', 'Campos'),
 ('Fernando', 'Arreola'),
 ('Adolfo', 'Millan'),
 ('Laura', 'Sandoval')]

8) Alumno natural join Asesor y Alumno cross join asesor

In [37]:
%%sql
SELECT * FROM alumno
NATURAL JOIN asesor;

 * postgresql://emilianodesu:***@localhost:5432/practica5
0 rows affected.

[]

In [36]:
%%sql
SELECT * FROM alumno
CROSS JOIN asesor;

 * postgresql://emilianodesu:***@localhost:5432/practica5
20 rows affected.

[(1, 'Mauricio', 'as-1', 'Barrientos', 'as-1', 'Jorge', 'Campos'),
 (1, 'Mauricio', 'as-1', 'Barrientos', 'as-2', 'Laura', 'Sandoval'),
 (1, 'Mauricio', 'as-1', 'Barrientos', 'as-3', 'Adolfo', 'Millan'),
 (1, 'Mauricio', 'as-1', 'Barrientos', 'as-4', 'Fernando', 'Arreola'),
 (2, 'Mario', 'as-2', 'Tabura', 'as-1', 'Jorge', 'Campos'),
 (2, 'Mario', 'as-2', 'Tabura', 'as-2', 'Laura', 'Sandoval'),
 (2, 'Mario', 'as-2', 'Tabura', 'as-3', 'Adolfo', 'Millan'),
 (2, 'Mario', 'as-2', 'Tabura', 'as-4', 'Fernando', 'Arreola'),
 (3, 'Luz', 'as-1', 'Rueda', 'as-1', 'Jorge', 'Campos'),
 (3, 'Luz', 'as-1', 'Rueda', 'as-2', 'Laura', 'Sandoval'),
 (3, 'Luz', 'as-1', 'Rueda', 'as-3', 'Adolfo', 'Millan'),
 (3, 'Luz', 'as-1', 'Rueda', 'as-4', 'Fernando', 'Arreola'),
 (4, 'Jorge', None, 'Santillan', 'as-1', 'Jorge', 'Campos'),
 (4, 'Jorge', None, 'Santillan', 'as-2', 'Laura', 'Sandoval'),
 (4, 'Jorge', None, 'Santillan', 'as-3', 'Adolfo', 'Millan'),
 (4, 'Jorge', None, 'Santillan', 'as-4', 'Fernando', 'Arreola'),
 (5, 'Laura', 'as-3', 'Gaytan', 'as-1', 'Jorge', 'Campos'),
 (5, 'Laura', 'as-3', 'Gaytan', 'as-2', 'Laura', 'Sandoval'),
 (5, 'Laura', 'as-3', 'Gaytan', 'as-3', 'Adolfo', 'Millan'),
 (5, 'Laura', 'as-3', 'Gaytan', 'as-4', 'Fernando', 'Arreola')]

9) Modificar la tabla Alumno, agregue los siguientes atributos: carrera varchar(40) y edad smallint

In [38]:
%%sql
ALTER TABLE alumno ADD COLUMN carrera VARCHAR(40) NULL,
ADD COLUMN edad SMALLINT NULL;

 * postgresql://emilianodesu:***@localhost:5432/practica5
Done.

[]

10) Insertar los siguientes 5 registros:

id_Alumno,nombre,ap_paterno, carrera,edad,id_asesor
- 6,Isaac,Lemus,Petrolera,30,as-1
- 7,Gabriela,Suarezs,Industrial,24,as-3
- 8,Pablo,Gonzalez,Computacion,23,as-2
- 9,David,Rivera,Industrial,25,as-1
- 10,Dayana,Plata,Computacion,24,as-4

In [39]:
%%sql
INSERT INTO alumno(id_Alumno, nombre, ap_pa, carrera, edad, id_Asesor)
VALUES
(6, 'Isaac', 'Lemus', 'Petrolera', 30, 'as-1'),
(7, 'Gabriela', 'Suarez', 'Industrial', 24, 'as-3'),
(8, 'Pablo', 'Gonzalez', 'Computacion', 23, 'as-2'),
(9, 'David', 'Rivera', 'Industrial', 25, 'as-1'),
(10, 'Dayana', 'Plata', 'Computación', 24, 'as-4');

 * postgresql://emilianodesu:***@localhost:5432/practica5
5 rows affected.

[]

11) Actualizar los 5 registros iniciales para asignar valores en los atributos agregados

- 1,Petrolera,27
- 2,Telecomunicaciones,24
- 3,Computacion,27
- 4,Industrial,25
- 5,Computacion,19

In [41]:
%%sql
UPDATE alumno SET carrera = 'Petrolera', edad = 27
WHERE id_Alumno = 1;
UPDATE alumno SET carrera = 'Telecomunicaciones', edad = 24
WHERE id_Alumno = 2;
UPDATE alumno SET carrera = 'Computacion', edad = 27
WHERE id_Alumno = 3;
UPDATE alumno SET carrera = 'Industrial', edad = 25
WHERE id_Alumno = 4;
UPDATE alumno SET carrera = 'Computacion', edad = 19
WHERE id_Alumno = 5;

 * postgresql://emilianodesu:***@localhost:5432/practica5
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

12) Validar que los datos coincidan con lo esperado

In [42]:
%%sql
SELECT * FROM alumno;

 * postgresql://emilianodesu:***@localhost:5432/practica5
10 rows affected.

[(6, 'Isaac', 'as-1', 'Lemus', 'Petrolera', 30),
 (7, 'Gabriela', 'as-3', 'Suarez', 'Industrial', 24),
 (8, 'Pablo', 'as-2', 'Gonzalez', 'Computacion', 23),
 (9, 'David', 'as-1', 'Rivera', 'Industrial', 25),
 (10, 'Dayana', 'as-4', 'Plata', 'Computación', 24),
 (1, 'Mauricio', 'as-1', 'Barrientos', 'Petrolera', 27),
 (2, 'Mario', 'as-2', 'Tabura', 'Telecomunicaciones', 24),
 (3, 'Luz', 'as-1', 'Rueda', 'Computacion', 27),
 (4, 'Jorge', None, 'Santillan', 'Industrial', 25),
 (5, 'Laura', 'as-3', 'Gaytan', 'Computacion', 19)]

13) Nombre completo del alumno de mayor edad

In [46]:
%%sql
SELECT alumno.nombre, alumno.ap_pa, alumno.edad
FROM alumno
WHERE edad = (SELECT edad FROM alumno ORDER BY edad DESC LIMIT 1);

 * postgresql://emilianodesu:***@localhost:5432/practica5
1 rows affected.

[('Isaac', 'Lemus', 30)]

14) Nombre completo del alumno de menor edad

In [47]:
%%sql
SELECT alumno.nombre, alumno.ap_pa, alumno.edad
FROM alumno
WHERE edad = (SELECT edad FROM alumno ORDER BY edad ASC LIMIT 1);

 * postgresql://emilianodesu:***@localhost:5432/practica5
1 rows affected.

[('Laura', 'Gaytan', 19)]

15) Cantidad de alumnos por carrera

In [49]:
%%sql
SELECT alumno.carrera, COUNT(alumno.id_Alumno) 
FROM alumno
GROUP BY carrera;

 * postgresql://emilianodesu:***@localhost:5432/practica5
5 rows affected.

[('Industrial', 3),
 ('Computación', 1),
 ('Telecomunicaciones', 1),
 ('Computacion', 3),
 ('Petrolera', 2)]

16) Nombre de la carrera que tiene a la persona más joven. Agrupar los datos.

In [65]:
%%sql
SELECT alumno.carrera FROM
alumno
GROUP BY carrera, edad
ORDER BY edad ASC LIMIT 1;

 * postgresql://emilianodesu:***@localhost:5432/practica5
1 rows affected.

[('Computacion',)]

17) Nombre de la carrera que tiene a la persona más grande. Agrupar los datos.

In [66]:
%%sql
SELECT alumno.carrera FROM
alumno
GROUP BY carrera, edad
ORDER BY edad DESC LIMIT 1;

 * postgresql://emilianodesu:***@localhost:5432/practica5
1 rows affected.

[('Petrolera',)]

18) Nombre de la carrera que tiene a la persona más joven. Usar subconsultas.

In [55]:
%%sql
SELECT alumno.carrera
FROM alumno
WHERE edad = (SELECT edad FROM alumno ORDER BY edad ASC LIMIT 1);

 * postgresql://emilianodesu:***@localhost:5432/practica5
1 rows affected.

[('Computacion',)]

19) Nombre de la carrera que tiene a la persona más grande. Usar subconsultas

In [54]:
%%sql
SELECT alumno.carrera
FROM alumno
WHERE edad = (SELECT edad FROM alumno ORDER BY edad DESC LIMIT 1);

 * postgresql://emilianodesu:***@localhost:5432/practica5
1 rows affected.

[('Petrolera',)]

20) Promedio de edad por carrera

In [68]:
%%sql
SELECT alumno.carrera, AVG(alumno.edad)
FROM alumno
GROUP BY carrera;

 * postgresql://emilianodesu:***@localhost:5432/practica5
5 rows affected.

[('Industrial', Decimal('24.6666666666666667')),
 ('Computación', Decimal('24.0000000000000000')),
 ('Telecomunicaciones', Decimal('24.0000000000000000')),
 ('Computacion', Decimal('23.0000000000000000')),
 ('Petrolera', Decimal('28.5000000000000000'))]

21) Borrar al asesor Adolfo Millan. Validar y explicar qué sucede en la tabla alumno.

In [69]:
%%sql
DELETE FROM asesor WHERE id_Asesor = 'as-3';

 * postgresql://emilianodesu:***@localhost:5432/practica5
1 rows affected.

[]

In [70]:
%%sql
SELECT * FROM asesor;

 * postgresql://emilianodesu:***@localhost:5432/practica5
3 rows affected.

[('as-1', 'Jorge', 'Campos'),
 ('as-2', 'Laura', 'Sandoval'),
 ('as-4', 'Fernando', 'Arreola')]

In [71]:
%%sql
SELECT * FROM alumno;

 * postgresql://emilianodesu:***@localhost:5432/practica5
10 rows affected.

[(6, 'Isaac', 'as-1', 'Lemus', 'Petrolera', 30),
 (8, 'Pablo', 'as-2', 'Gonzalez', 'Computacion', 23),
 (9, 'David', 'as-1', 'Rivera', 'Industrial', 25),
 (10, 'Dayana', 'as-4', 'Plata', 'Computación', 24),
 (1, 'Mauricio', 'as-1', 'Barrientos', 'Petrolera', 27),
 (2, 'Mario', 'as-2', 'Tabura', 'Telecomunicaciones', 24),
 (3, 'Luz', 'as-1', 'Rueda', 'Computacion', 27),
 (4, 'Jorge', None, 'Santillan', 'Industrial', 25),
 (7, 'Gabriela', None, 'Suarez', 'Industrial', 24),
 (5, 'Laura', None, 'Gaytan', 'Computacion', 19)]

22) Actualizar el id del asesor Fernando Arreola, asignar "as-5". Validar y explicar qué sucede en la tabla alumno.

In [72]:
%%sql
UPDATE asesor SET id_Asesor = 'as-5' WHERE id_Asesor = 'as-4';

 * postgresql://emilianodesu:***@localhost:5432/practica5
1 rows affected.

[]

In [73]:
%%sql
SELECT * FROM asesor;

 * postgresql://emilianodesu:***@localhost:5432/practica5
3 rows affected.

[('as-1', 'Jorge', 'Campos'),
 ('as-2', 'Laura', 'Sandoval'),
 ('as-5', 'Fernando', 'Arreola')]

In [74]:
%%sql
SELECT * FROM alumno;

 * postgresql://emilianodesu:***@localhost:5432/practica5
10 rows affected.

[(6, 'Isaac', 'as-1', 'Lemus', 'Petrolera', 30),
 (8, 'Pablo', 'as-2', 'Gonzalez', 'Computacion', 23),
 (9, 'David', 'as-1', 'Rivera', 'Industrial', 25),
 (1, 'Mauricio', 'as-1', 'Barrientos', 'Petrolera', 27),
 (2, 'Mario', 'as-2', 'Tabura', 'Telecomunicaciones', 24),
 (3, 'Luz', 'as-1', 'Rueda', 'Computacion', 27),
 (4, 'Jorge', None, 'Santillan', 'Industrial', 25),
 (7, 'Gabriela', None, 'Suarez', 'Industrial', 24),
 (5, 'Laura', None, 'Gaytan', 'Computacion', 19),
 (10, 'Dayana', 'as-5', 'Plata', 'Computación', 24)]

23) Inicie sesion en dos terminales , conectandose en ambas a la base de datos donde almaceno los datos del presente ejercicio
- en ambas sesiones, inicie una transaccion
- en la ventana A, actualice el apellido del alumno con id = 7 por "Suarez"
- en la ventana B, seleccione toda la información del alumno con id = 7. ¿Qué observa?
- en la ventana A, ingrese commit
- en la ventana B, seleccione toda la información del alumno con id = 7, posteriormente rollback. ¿Qué observa?
- justifique los resultados obtenidos